testCases/01_body_immersion_test_Case/ZZ_create_body_work/Allrun
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf 0

cp -r 0.org 0


runApplication blockMesh

application=`getApplication`

runApplication $application

paraFoam -touch

# ----------------------------------------------------------------- end-of-file
