testCases/01_body_immersion_test_Case/ZZ_create_body_work/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    z1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       22800;
    }
    z0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       23200;
    }
    x1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       23600;
    }
    x0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       24000;
    }
    y0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       24400;
    }
    y1
    {
        type            patch;
        nFaces          400;
        startFace       24800;
    }
)

// ************************************************************************* //
